import json
from course.models import Prereq, Coreq, AllCourses

coreq = {
    "مدارهای الکتریکی و الکترونیکی":["معادلات دیفرانسیل", "فیزیک 2"],
    "فیزیک 2":["ریاضی 1"],
    "آز فیزیک 2":["فیزیک 2"],
    "ریاضیات گسسته":["مبانی کامپیوتر و برنامه سازی", "ریاضی 1"],
    "مدارهای منطقی":["ریاضیات گسسته"],
    "جبر خطی":["ریاضی 2"],
    "ساختمان داده ها":["ریاضیات گسسته"],
    "نظریه زبانها و ماشینها":["ساختمان داده ها"],
    "آزمایشگاه مدارهای منطقی و معماری کامپیوتر":["معماری کامپیوتر"],
    "تحلیل و طراحی سیستم ها":["ساختمان داده ها"],
    "شبکه های کامپیوتری":["سیستم های عامل"],
    "آزمایشگاه ریزپردازنده":["ریزپردازنده و مدارهای واسط"],
    "مبانی سیستم های نهفته و بیدرنگ":["سیستم های عامل"],
    "کارگاه برنامه نویسی مت لب":["سیگنالها و سیستمها"],
    "مهندسی اینترنت":["پایگاه داده ها"]
}

prereq = {
    "برنامه سازی پیشرفته":["مبانی کامپیوتر و برنامه سازی"],
    "ریاضی 2":["ریاضی 1"],
    "معادلات دیفرانسیل":["ریاضی 1"],
    "سیگنالها و سیستمها":["معادلات دیفرانسیل"],
    "مدارهای مجتمع دیجیتال":["مدارهای الکتریکی و الکترونیکی"],
    "زبان تخصصی":["زبان خارجی"],
    "ساختمان داده ها":["برنامه سازی پیشرفته"],
    "آزمایشگاه مدارهای منطقی و معماری کامپیوتر":["مدارهای منطقی"],
    "معماری کامپیوتر":["مدارهای منطقی"],
    "آمار و احتمالات مهندسی":["ریاضی 2"],
    "طراحی الگوریتم ها":["ساختمان داده ها"],
    "هوش مصنوعی و سیستم های خبره":["ساختمان داده ها"],
    "اصول طراحی کامپایلر":["نظریه زبانها و ماشینها"],
    "سیستم های عامل":["معماری کامپیوتر"],
    "روش پژوهش و ارائه":["زبان تخصصی"],
    "پایگاه داده ها":["ساختمان داده ها"],
    "مهندسی نرم افزار":["تحلیل و طراحی سیستم ها"],
    "آزمایشگاه سیستم های عامل":["سیستم های عامل"],
    "ریزپردازنده و مدارهای واسط":["معماری کامپیوتر"],
    "کارآموزی":["مدرسه تکمیلی", "روش پژوهش و ارائه"],
    "آزمایشگاه شبکه های کامپیوتری":["شبکه های کامپیوتری"],
    "مبانی امنیت سایبری":["شبکه های کامپیوتری"],
    "مبانی سیستم های نهفته و بیدرنگ":["ریزپردازنده و مدارهای واسط", "سیگنالها و سیستمها"],
    "پروژه کارشناسی":["روش پژوهش و ارائه"],
    "مبانی یادگیری ماشین":["جبر خطی", "هوش مصنوعی و سیستم های خبره"],
    "طراحی کامپیوتری سیستم های دیجیتال":["معماری کامپیوتر"],
    "اصول مدیریت و برنامه ریزی راهبردی فناوری اطلاعات":["تحلیل و طراحی سیستم ها"],
    "سیستم های اطلاعات مدیریت":["تحلیل و طراحی سیستم ها"],
    "هم طراحی سخت افزار- نرم افزار":["طراحی کامپیوتری سیستم های دیجیتال"],
    "طراحی بازی های رایانه ای":["ساختمان داده ها"],
    "مبانی رمزنگاری":["مدارهای منطقی"],
    "مبانی بینائی کامپیوتر":["هوش مصنوعی و سیستم های خبره"],
    "آزمایشگاه پایگاه داده":["پایگاه داده ها"],
    "مبانی اینترنت اشیا":["شبکه های کامپیوتری", "ریزپردازنده و مدارهای واسط"],
    "مبانی داده کاوی":["هوش مصنوعی و سیستم های خبره"],
    "تظریه و الگوریتم های گراف":["ریاضیات گسسته"]
}


for key, value in coreq.items():
    try:
        course = AllCourses.objects.get(courseName=key)
    except:
        print("key:",key)
    for c in value:
        try:
            coreq_course = AllCourses.objects.get(courseName=c)
            Coreq.objects.get_or_create(course=course, coreq_course=coreq_course)
        except:
            print("c:",c)
        
for key, value in prereq.items():
    try:
        course = AllCourses.objects.get(courseName=key)
    except:
        print("key:",key)
    for c in value:
        try:
            prereq_course = AllCourses.objects.get(courseName=c)
            Prereq.objects.get_or_create(course=course, prereq_course=prereq_course)
        except:
            print("c:",c)