import json
from course.models import Prereq, Coreq, AllCourses

coreq = {
    "مدار های الکتریکی و الکترونیکی":["معادلات دیفرانسیل", "فیزیک 2"],
    "فیزیک 2":["ریاضی 1"],
    "آز فیزیک 2":["فیزیک 2"],
    "ریاضی گسسته":["مبانی کامپیوتر و برنامه سازی", "ریاضی 1"],
    "مدار منطقی":["ریاضی گسسته"],
    "جبر خطی":["ریاضی 2"],
    "ساختمان داده ها":["ریاضی گسسته"],
    "نظریه زبانها و ماشینها":["ساختمان داده ها"],
    "آز منطقی معماری":["معماری کامپیوتر"],
    "تحلیل و طراحی سیستم":["ساختمان داده ها"],
    "شبکه های کامپیوتری":["سیستم های عامل"],
    "آز ریزپردازنده":["ریزپردازنده و مدار واسط"],
    "سیستم نهفته بیدرنگ":["سیستم های عامل"]
}

prereq = {
    "برنامه سازی پیشرفته":["مبانی کامپیوتر و برنامه سازی"],
    "ریاضی 2":["ریاضی 1"],
    "معادلات دیفرانسیل":["ریاضی 1"],
    "سیگنالها و سیستمها":["معادلات دیفرانسیل"],
    "مدار مجتمع دیجیتال":["مدار های الکتریکی و الکترونیکی"],
    "زبان تخصصی":["زبان خارجی"],
    "ساختمان داده ها":["برنامه سازی پیشرفته"],
    "آز منطقی معماری":["مدار منطقی"],
    "معماری کامپیوتر":["مدار منطقی"],
    "آمار و احتمالات مهندسی":["ریاضی 2"],
    "طراحی الگوریتم":["ساختمان داده ها"],
    "هوش و سیستم خبره":["ساختمان داده ها"],
    "کامپایلر":["نظریه زبانها و ماشینها"],
    "سیستم های عامل":["معماری کامپیوتر"],
    "روش پژوهش":["زبان تخصصی"],
    "پایگاه داده":["ساختمان داده ها"],
    "مهندسی نرم افزار":["تحلیل و طراحی سیستم"],
    "آز سیستم های عامل":["سیستم های عامل"],
    "ریزپردازنده و مدار واسط":["معماری کامپیوتر"],
    "کارآموزی":["مدرسه تکمیلی", "روش پژوهش"],
    "آز شبکه":["شبکه های کامپیوتری"],
    "مبانی امنیت سایبری":["شبکه های کامپیوتری"],
    "سیستم نهفته بیدرنگ":["ریزپردازنده و مدار واسط", "سیگنالها و سیستمها"],
    "پروژه کارشناسی":["روش پژوهش"],
    "مبانی یادگیری ماشین":["جبر خطی", "هوش و سیستم خبره"],
    "طراحی کامپیوتری سیستمهای دیجیتال":["معماری کامپیوتر"]
}


for key, value in coreq.items():
    try:
        course = AllCourses.objects.get(courseName=key)
    except:
        print("key:",key)
    for c in value:
        try:
            coreq_course = AllCourses.objects.get(courseName=c)
            Coreq.objects.create(course=course, coreq_course=coreq_course)
        except:
            print("c:",c)
        
for key, value in prereq.items():
    try:
        course = AllCourses.objects.get(courseName=key)
    except:
        print("key:",key)
    for c in value:
        try:
            prereq_course = AllCourses.objects.get(courseName=c)
            Prereq.objects.create(course=course, prereq_course=prereq_course)
        except:
            print("c:",c)